[Killed] ObjectLiteral
src/utils/responsive.ts:4:28
 import { useEffect, useState } from 'react';
 
 // Breakpoint definitions
-export const breakpoints = {
-  sm: 640,
-  md: 768,
-  lg: 1024,
-  xl: 1280,
-  '2xl': 1536,
-};
+export const breakpoints = {};
 
 // Hook to detect screen size
killedBy: Responsive Utilities useScreenSize should detect mobile screens correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ConditionalExpression
src/utils/responsive.ts:15:12
 // Hook to detect screen size
 export function useScreenSize() {
   const [screenSize, setScreenSize] = useState({
-    width: typeof window !== 'undefined' ? window.innerWidth : 0,
+    width: false ? window.innerWidth : 0,
     height: typeof window !== 'undefined' ? window.innerHeight : 0,
   });

[Survived] ConditionalExpression
src/utils/responsive.ts:15:12
 // Hook to detect screen size
 export function useScreenSize() {
   const [screenSize, setScreenSize] = useState({
-    width: typeof window !== 'undefined' ? window.innerWidth : 0,
+    width: true ? window.innerWidth : 0,
     height: typeof window !== 'undefined' ? window.innerHeight : 0,
   });

[Survived] EqualityOperator
src/utils/responsive.ts:16:13
 export function useScreenSize() {
   const [screenSize, setScreenSize] = useState({
     width: typeof window !== 'undefined' ? window.innerWidth : 0,
-    height: typeof window !== 'undefined' ? window.innerHeight : 0,
+    height: typeof window === 'undefined' ? window.innerHeight : 0,
   });
 

[Survived] ConditionalExpression
src/utils/responsive.ts:16:13
 export function useScreenSize() {
   const [screenSize, setScreenSize] = useState({
     width: typeof window !== 'undefined' ? window.innerWidth : 0,
-    height: typeof window !== 'undefined' ? window.innerHeight : 0,
+    height: true ? window.innerHeight : 0,
   });
 

[Survived] BooleanLiteral
src/utils/responsive.ts:19:44
     height: typeof window !== 'undefined' ? window.innerHeight : 0,
   });
 
-  const [isMobile, setIsMobile] = useState(false);
+  const [isMobile, setIsMobile] = useState(true);
   const [isTablet, setIsTablet] = useState(false);
   const [isDesktop, setIsDesktop] = useState(false);

[Survived] BooleanLiteral
src/utils/responsive.ts:20:44
   });
 
   const [isMobile, setIsMobile] = useState(false);
-  const [isTablet, setIsTablet] = useState(false);
+  const [isTablet, setIsTablet] = useState(true);
   const [isDesktop, setIsDesktop] = useState(false);
 

[Survived] BooleanLiteral
src/utils/responsive.ts:21:46
 
   const [isMobile, setIsMobile] = useState(false);
   const [isTablet, setIsTablet] = useState(false);
-  const [isDesktop, setIsDesktop] = useState(false);
+  const [isDesktop, setIsDesktop] = useState(true);
 
   useEffect(() => {

[Killed] BlockStatement
src/utils/responsive.ts:23:19
   const [isTablet, setIsTablet] = useState(false);
   const [isDesktop, setIsDesktop] = useState(false);
 
-  useEffect(() => {
-    // Only run on client side
-    if (typeof window === 'undefined') return;
-
-    const handleResize = () => {
-      const width = window.innerWidth;
-      const height = window.innerHeight;
-      
-      setScreenSize({ width, height });
-      setIsMobile(width < breakpoints.md);
-      setIsTablet(width >= breakpoints.md && width < breakpoints.lg);
-      setIsDesktop(width >= breakpoints.lg);
-    };
-
-    // Set initial values
-    handleResize();
-
-    // Add event listener
-    window.addEventListener('resize', handleResize);
-    
-    // Clean up
-    return () => window.removeEventListener('resize', handleResize);
-  }, []);
+  useEffect(() => {}, []);
 
   return {
killedBy: Responsive Utilities useScreenSize should detect mobile screens correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/utils/responsive.ts:25:9
 
   useEffect(() => {
     // Only run on client side
-    if (typeof window === 'undefined') return;
+    if (true) return;
 
     const handleResize = () => {
killedBy: Responsive Utilities useScreenSize should detect mobile screens correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/utils/responsive.ts:25:9
 
   useEffect(() => {
     // Only run on client side
-    if (typeof window === 'undefined') return;
+    if (typeof window !== 'undefined') return;
 
     const handleResize = () => {
killedBy: Responsive Utilities useScreenSize should detect mobile screens correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/utils/responsive.ts:27:32
     // Only run on client side
     if (typeof window === 'undefined') return;
 
-    const handleResize = () => {
-      const width = window.innerWidth;
-      const height = window.innerHeight;
-      
-      setScreenSize({ width, height });
-      setIsMobile(width < breakpoints.md);
-      setIsTablet(width >= breakpoints.md && width < breakpoints.lg);
-      setIsDesktop(width >= breakpoints.lg);
-    };
+    const handleResize = () => {};
 
     // Set initial values
killedBy: Responsive Utilities useScreenSize should detect mobile screens correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/utils/responsive.ts:32:19
       const height = window.innerHeight;
       
       setScreenSize({ width, height });
-      setIsMobile(width < breakpoints.md);
+      setIsMobile(false);
       setIsTablet(width >= breakpoints.md && width < breakpoints.lg);
       setIsDesktop(width >= breakpoints.lg);
killedBy: Responsive Utilities useScreenSize should detect mobile screens correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/utils/responsive.ts:32:19
       const height = window.innerHeight;
       
       setScreenSize({ width, height });
-      setIsMobile(width < breakpoints.md);
+      setIsMobile(true);
       setIsTablet(width >= breakpoints.md && width < breakpoints.lg);
       setIsDesktop(width >= breakpoints.lg);
killedBy: Responsive Utilities useScreenSize should detect mobile screens correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/utils/responsive.ts:33:19
       
       setScreenSize({ width, height });
       setIsMobile(width < breakpoints.md);
-      setIsTablet(width >= breakpoints.md && width < breakpoints.lg);
+      setIsTablet(width < breakpoints.md && width < breakpoints.lg);
       setIsDesktop(width >= breakpoints.lg);
     };
killedBy: Responsive Utilities useScreenSize should detect mobile screens correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/utils/responsive.ts:33:46
       
       setScreenSize({ width, height });
       setIsMobile(width < breakpoints.md);
-      setIsTablet(width >= breakpoints.md && width < breakpoints.lg);
+      setIsTablet(width >= breakpoints.md && width >= breakpoints.lg);
       setIsDesktop(width >= breakpoints.lg);
     };
killedBy: Dark Mode Integration Tests Navbar Dark Mode applies dark mode classes to Navbar components
statusReason: TestingLibraryElementError: Found multiple elements with the role "menu"

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  aria-labelledby="user-menu"
  aria-orientation="vertical"

[Killed] ConditionalExpression
src/utils/responsive.ts:34:20
       setScreenSize({ width, height });
       setIsMobile(width < breakpoints.md);
       setIsTablet(width >= breakpoints.md && width < breakpoints.lg);
-      setIsDesktop(width >= breakpoints.lg);
+      setIsDesktop(true);
     };
 
killedBy: Responsive Utilities useScreenSize should detect mobile screens correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/utils/responsive.ts:34:20
       setScreenSize({ width, height });
       setIsMobile(width < breakpoints.md);
       setIsTablet(width >= breakpoints.md && width < breakpoints.lg);
-      setIsDesktop(width >= breakpoints.lg);
+      setIsDesktop(false);
     };
 
killedBy: Responsive Utilities useScreenSize should detect desktop screens correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
src/utils/responsive.ts:41:29
     handleResize();
 
     // Add event listener
-    window.addEventListener('resize', handleResize);
+    window.addEventListener("", handleResize);
     
     // Clean up
killedBy: Responsive Utilities useScreenSize should detect mobile screens correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ArrowFunction
src/utils/responsive.ts:44:12
     window.addEventListener('resize', handleResize);
     
     // Clean up
-    return () => window.removeEventListener('resize', handleResize);
+    return () => undefined;
   }, []);
 

[Killed] BlockStatement
src/utils/responsive.ts:57:105
 }
 
 // Helper to conditionally apply styles based on screen size
-export function getResponsiveClasses(defaultClasses: string, responsiveClasses: Record<string, string>) {
-  return Object.entries(responsiveClasses).reduce(
-    (acc, [breakpoint, classes]) => `${acc} ${breakpoint}:${classes}`,
-    defaultClasses
-  );
-} 
+export function getResponsiveClasses(defaultClasses: string, responsiveClasses: Record<string, string>) {} 
killedBy: Responsive Utilities getResponsiveClasses should combine default classes with responsive variants
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "text-base font-medium sm:text-sm md:text-md lg:text-lg"
Received: undefined

[Killed] ArrowFunction
src/utils/responsive.ts:59:5
 // Helper to conditionally apply styles based on screen size
 export function getResponsiveClasses(defaultClasses: string, responsiveClasses: Record<string, string>) {
   return Object.entries(responsiveClasses).reduce(
-    (acc, [breakpoint, classes]) => `${acc} ${breakpoint}:${classes}`,
+    () => undefined,
     defaultClasses
   );
killedBy: Responsive Utilities getResponsiveClasses should combine default classes with responsive variants
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "text-base font-medium sm:text-sm md:text-md lg:text-lg"
Received: undefined
